OpenFOAM-2.3.0/tutorials/multiphase/settlingFoam/ras/dahl/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

muc             muc [ 1 -1 -1 0 0 0 0 ] 0.00178;

plasticViscosityCoeff plasticViscosityCoeff [ 1 -1 -1 0 0 0 0 ] 0.00023143;

plasticViscosityExponent plasticViscosityExponent [ 0 0 0 0 0 0 0 ] 179.26;

BinghamPlastic  on;

yieldStressCoeff yieldStressCoeff [ 1 -1 -2 0 0 0 0 ] 0.00042189;

yieldStressExponent yieldStressExponent [ 0 0 0 0 0 0 0 ] 1050.8;

yieldStressOffset yieldStressOffset [ 0 0 0 0 0 0 0 ] 0;

muMax           muMax [ 1 -1 -1 0 0 0 0 ] 10.0;

rhoc            rhoc [ 1 -3 0 0 0 0 0 ] 996;

rhod            rhod [ 1 -3 0 0 0 0 0 ] 1996;

VdjModel        simple;

simpleCoeffs
{
    V0              V0 [ 0 1 -1 0 0 0 0 ] ( 0 -0.002198 0 );
    a               a [ 0 0 0 0 0 0 0 ] 285.84;
    a1              a1 [ 0 0 0 0 0 0 0 ] 0;
    alphaMin        alphaMin [ 0 0 0 0 0 0 0 ] 0;
}

generalCoeffs
{
    V0              V0 [ 0 1 -1 0 0 0 0 ] ( 0 -0.0018 0 );
    a               a [ 0 0 0 0 0 0 0 ] 1e-05;
    a1              a1 [ 0 0 0 0 0 0 0 ] 0.1;
    alphaMin        alphaMin [ 0 0 0 0 0 0 0 ] 2e-05;
}


// ************************************************************************* //
